leetcode-notes.org.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-03 二 21:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>leetcode notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rcmerci" />
<meta name="keywords" content="algorithm" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="preamble" class="status">
<p class="author">Author: rcmerci</p>
<p class="date">Updated: 2019-12-03 二 21:26</p>
</div>
<div id="content">
<h1 class="title">leetcode notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9122ae7">0.1. two sum</a></li>
<li><a href="#org60d94bb">0.2. add two numbers</a></li>
<li><a href="#orgfc353a5">0.3. Longest Substring Without Repeating Characters</a></li>
<li><a href="#orgfcf9eec">0.4. Median of Two Sorted Arrays</a></li>
<li><a href="#org45fee04">0.5. Longest Palindromic Substring</a></li>
<li><a href="#orgfeae17f">0.6. ZigZag Conversion</a></li>
<li><a href="#org069f6ae">0.7. Reverse Integer</a></li>
<li><a href="#org363f8f3">0.8. String to Integer (atoi)</a></li>
</ul>
</li>
<li><a href="#org1acfe1a">1. Bear in mind</a></div>
</div>


<div id="outline-container-org9122ae7" class="outline-3">
<h3 id="org9122ae7"><span class="section-number-3">0.1</span> two sum</h3>
<div class="outline-text-3" id="text-0-1">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #989848;">package</span> main
<span style="color: #989848;">import</span> (
        <span style="color: #b85c57;">"fmt"</span>
)

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">twoSum</span>(nums []<span style="color: #0287c8; font-weight: bold;">int</span>, target <span style="color: #0287c8; font-weight: bold;">int</span>) []<span style="color: #0287c8; font-weight: bold;">int</span> {
        m := <span style="color: #989848;">map</span>[<span style="color: #0287c8; font-weight: bold;">int</span>]<span style="color: #0287c8; font-weight: bold;">int</span>{}
        <span style="color: #989848;">for</span> i := <span style="color: #989848;">range</span> nums {
                ind, ok := m[target-nums[i]]
                <span style="color: #989848;">if</span> ok {
                        <span style="color: #989848;">return</span> []<span style="color: #0287c8; font-weight: bold;">int</span>{ind, i}
                }
                m[nums[i]] = i
        }
        <span style="color: #989848;">return</span> <span style="color: #989848; font-weight: bold;">nil</span>
}

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">main</span>() {
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, <span style="color: #424242; font-weight: bold;">twoSum</span>([]<span style="color: #0287c8; font-weight: bold;">int</span>{2, 7, 11, 15}, 9)) <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org60d94bb" class="outline-3">
<h3 id="org60d94bb"><span class="section-number-3">0.2</span> add two numbers</h3>
<div class="outline-text-3" id="text-0-2">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #989848;">package</span> main
<span style="color: #989848;">import</span> (
        <span style="color: #b85c57;">"fmt"</span>
)

<span style="color: #40883f;">/**</span>
<span style="color: #40883f;"> * Definition for singly-linked list.</span>
<span style="color: #40883f;"> * type ListNode struct {</span>
<span style="color: #40883f;"> *     Val int</span>
<span style="color: #40883f;"> *     Next *ListNode</span>
<span style="color: #40883f;"> * }</span>
<span style="color: #40883f;"> */</span>
<span style="color: #989848;">type</span> <span style="color: #0287c8; font-weight: bold;">ListNode</span> <span style="color: #989848;">struct</span> {
        Val  int
        Next *ListNode
}

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">addTwoNumbers</span>(l1 *<span style="color: #0287c8; font-weight: bold;">ListNode</span>, l2 *<span style="color: #0287c8; font-weight: bold;">ListNode</span>) *<span style="color: #0287c8; font-weight: bold;">ListNode</span> {
        r := <span style="color: #0287c8; font-weight: bold;">ListNode</span>{}
        tmpr := &amp;r
        <span style="color: #989848;">var</span> last *ListNode
        carry := <span style="color: #989848; font-weight: bold;">false</span>
        <span style="color: #989848;">for</span> {
                rr := 0
                <span style="color: #989848;">if</span> carry {
                        rr += 1
                        carry = <span style="color: #989848; font-weight: bold;">false</span>
                }
                <span style="color: #989848;">if</span> l1 != <span style="color: #989848; font-weight: bold;">nil</span> {
                        rr += l1.Val
                        l1 = l1.Next
                }
                <span style="color: #989848;">if</span> l2 != <span style="color: #989848; font-weight: bold;">nil</span> {
                        rr += l2.Val
                        l2 = l2.Next
                }
                <span style="color: #989848;">if</span> rr &gt; 9 {
                        carry = <span style="color: #989848; font-weight: bold;">true</span>
                        rr -= 10
                }
                <span style="color: #989848;">if</span> rr == 0 &amp;&amp; !carry &amp;&amp; l1 == <span style="color: #989848; font-weight: bold;">nil</span> &amp;&amp; l2 == <span style="color: #989848; font-weight: bold;">nil</span> {
                        <span style="color: #989848;">if</span> last != <span style="color: #989848; font-weight: bold;">nil</span> {
                                last.Next = <span style="color: #989848; font-weight: bold;">nil</span>
                        }
                        <span style="color: #989848;">return</span> &amp;r
                }
                tmpr.Val = rr
                tmpr.Next = &amp;<span style="color: #0287c8; font-weight: bold;">ListNode</span>{}
                tmpr.Next.Next = <span style="color: #989848; font-weight: bold;">nil</span>
                last = tmpr
                tmpr = tmpr.Next
        }
        <span style="color: #989848;">return</span> <span style="color: #989848; font-weight: bold;">nil</span>
}

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">main</span>() {
        l1 := &amp;<span style="color: #0287c8; font-weight: bold;">ListNode</span>{Val: 2, Next: &amp;<span style="color: #0287c8; font-weight: bold;">ListNode</span>{Val: 4, Next: &amp;<span style="color: #0287c8; font-weight: bold;">ListNode</span>{Val: 3, Next: <span style="color: #989848; font-weight: bold;">nil</span>}}}
        l2 := &amp;<span style="color: #0287c8; font-weight: bold;">ListNode</span>{Val: 5, Next: &amp;<span style="color: #0287c8; font-weight: bold;">ListNode</span>{Val: 6, Next: &amp;<span style="color: #0287c8; font-weight: bold;">ListNode</span>{Val: 4, Next: <span style="color: #989848; font-weight: bold;">nil</span>}}}
        r := <span style="color: #424242; font-weight: bold;">addTwoNumbers</span>(l1, l2)
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, r)                <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, r.Next)           <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, r.Next.Next)      <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, r.Next.Next.Next) <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc353a5" class="outline-3">
<h3 id="orgfc353a5"><span class="section-number-3">0.3</span> Longest Substring Without Repeating Characters</h3>
<div class="outline-text-3" id="text-0-3">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #989848;">package</span> main

<span style="color: #989848;">import</span> (
        <span style="color: #b85c57;">"fmt"</span>
)

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">lengthOfLongestSubstring</span>(s <span style="color: #0287c8; font-weight: bold;">string</span>) <span style="color: #0287c8; font-weight: bold;">int</span> {
        m := <span style="color: #989848;">map</span>[<span style="color: #0287c8; font-weight: bold;">byte</span>]<span style="color: #0287c8; font-weight: bold;">int</span>{}
        i, j := 0, 0
        max := 0
        <span style="color: #989848;">for</span> ; j &lt; <span style="color: #424242; font-weight: bold;">len</span>(s); j++ {
                <span style="color: #989848;">if</span> ind, ok := m[s[j]]; ok &amp;&amp; ind &gt;= i {
                        i = ind + 1
                }
                m[s[j]] = j
                <span style="color: #989848;">if</span> max &lt; j-i+1 {
                        max = j - i + 1
                }
        }
        <span style="color: #989848;">return</span> max
}

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">main</span>() {
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, <span style="color: #424242; font-weight: bold;">lengthOfLongestSubstring</span>(<span style="color: #b85c57;">"abcabcbb"</span>)) <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, <span style="color: #424242; font-weight: bold;">lengthOfLongestSubstring</span>(<span style="color: #b85c57;">"bbbbbbbb"</span>)) <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, <span style="color: #424242; font-weight: bold;">lengthOfLongestSubstring</span>(<span style="color: #b85c57;">"pwwkew"</span>))   <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, <span style="color: #424242; font-weight: bold;">lengthOfLongestSubstring</span>(<span style="color: #b85c57;">"abba"</span>))     <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>
}


</pre>
</div>
</div>
</div>
