leetcode-notes.org
** Median of Two Sorted Arrays
#+BEGIN_SRC go
  package main

  import (
          "fmt"
  )

  func findMedianSortedArrays(nums1 []int, nums2 []int) float64 {
          m := len(nums1)
          n := len(nums2)
          if m > n {
                  n, m = m, n
                  nums1, nums2 = nums2, nums1
          }
          imin, imax := 0, m
          for imin <= imax {
                  i := (imin + imax) / 2
                  j := (m+n)/2 - i
                  if i > 0 && nums1[i-1] > nums2[j] {
                          imax = i - 1
                  } else if i < imax && nums2[j-1] > nums1[i] {
                          imin = i + 1
                  } else {
                          maxleft := 0
                          minright := 0
                          if i == m {
                                  minright = nums2[j]
                          } else if j == n {
                                  minright = nums1[i]
                          } else {
                                  if nums1[i] < nums2[j] {
                                          minright = nums1[i]
                                  } else {
                                          minright = nums2[j]
                                  }
                          }
                          if (m+n)%2 == 1 {
                                  return float64(minright)
                          }
                          if i < 1 {
                                  maxleft = nums2[j-1]
                          } else if j < 1 {
                                  maxleft = nums1[i-1]
                          } else {
                                  if nums1[i-1] > nums2[j-1] {
                                          maxleft = nums1[i-1]
                                  } else {
                                          maxleft = nums2[j-1]
                                  }
                          }

                          return float64(minright+maxleft) / 2.0
                  }
          }

          return 0.0
  }

  func main() {
          fmt.Printf("%+v\n", findMedianSortedArrays([]int{1, 2, 3, 5, 6, 7, 8}, []int{3, 4})) // output for debug
  }

#+END_SRC

#+RESULTS:
: 4

** Longest Palindromic Substring
#+BEGIN_SRC go
  package main

  import (
          "fmt"
  )

  func longestPalindrome(s string) string {
          if len(s) == 0 {
                  return ""
          }
          m := [1000][1000]bool{}
          for i := 0; i < len(s); i++ {
                  m[i][i] = true
          }
          for l := 1; l < len(s); l++ {
                  for i := 0; i+l < len(s); i++ {

                          if i+1 <= i+l-1 && m[i+1][i+l-1] && s[i] == s[i+l] {
                                  m[i][i+l] = true
                          } else if l == 1 && s[i] == s[i+l] {
                                  m[i][i+l] = true
                          }
                  }
          }

          max := 1
          maxs := string([]byte(s)[0:1])
          for i := 0; i < len(s); i++ {
                  for j := i; j < len(s); j++ {
                          if m[i][j] && j-i+1 > max {
                                  max = j - i + 1
                                  maxs = string([]byte(s)[i : j+1])
                          }
                  }
          }
          return maxs
  }

  func main() {
          fmt.Printf("%+v\n", longestPalindrome("babad")) // output for debug
          fmt.Printf("%+v\n", longestPalindrome("cbbd"))  // output for debug
          fmt.Printf("%+v\n", longestPalindrome(""))      // output for debug
  }
#+END_SRC

** ZigZag Conversion
#+BEGIN_SRC go
func convert(s string, numRows int) string {
	if numRows == 1 {
		return s
	}
	lines := make([][]byte, numRows)
	i := 0
	add := true
	for _, c := range []byte(s) {
		lines[i] = append(lines[i], c)
		if add {
			if i+1 >= numRows {
				i--
				add = false
			} else {
				i++
			}
		} else {
			if i-1 < 0 {
				i++
				add = true
			} else {
				i--
			}
		}
	}

	for i := 1; i < numRows; i++ {
		lines[0] = append(lines[0], lines[i]...)
	}
	return string(lines[0])
}
#+END_SRC
