leetcode-notes.org.html

<div id="outline-container-orgfcf9eec" class="outline-3">
<h3 id="orgfcf9eec"><span class="section-number-3">0.4</span> Median of Two Sorted Arrays</h3>
<div class="outline-text-3" id="text-0-4">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #989848;">package</span> main

<span style="color: #989848;">import</span> (
        <span style="color: #b85c57;">"fmt"</span>
)

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">findMedianSortedArrays</span>(nums1 []<span style="color: #0287c8; font-weight: bold;">int</span>, nums2 []<span style="color: #0287c8; font-weight: bold;">int</span>) <span style="color: #0287c8; font-weight: bold;">float64</span> {
        m := <span style="color: #424242; font-weight: bold;">len</span>(nums1)
        n := <span style="color: #424242; font-weight: bold;">len</span>(nums2)
        <span style="color: #989848;">if</span> m &gt; n {
                n, m = m, n
                nums1, nums2 = nums2, nums1
        }
        imin, imax := 0, m
        <span style="color: #989848;">for</span> imin &lt;= imax {
                i := (imin + imax) / 2
                j := (m+n)/2 - i
                <span style="color: #989848;">if</span> i &gt; 0 &amp;&amp; nums1[i-1] &gt; nums2[j] {
                        imax = i - 1
                } <span style="color: #989848;">else</span> <span style="color: #989848;">if</span> i &lt; imax &amp;&amp; nums2[j-1] &gt; nums1[i] {
                        imin = i + 1
                } <span style="color: #989848;">else</span> {
                        maxleft := 0
                        minright := 0
                        <span style="color: #989848;">if</span> i == m {
                                minright = nums2[j]
                        } <span style="color: #989848;">else</span> <span style="color: #989848;">if</span> j == n {
                                minright = nums1[i]
                        } <span style="color: #989848;">else</span> {
                                <span style="color: #989848;">if</span> nums1[i] &lt; nums2[j] {
                                        minright = nums1[i]
                                } <span style="color: #989848;">else</span> {
                                        minright = nums2[j]
                                }
                        }
                        <span style="color: #989848;">if</span> (m+n)%2 == 1 {
                                <span style="color: #989848;">return</span> <span style="color: #424242; font-weight: bold;">float64</span>(minright)
                        }
                        <span style="color: #989848;">if</span> i &lt; 1 {
                                maxleft = nums2[j-1]
                        } <span style="color: #989848;">else</span> <span style="color: #989848;">if</span> j &lt; 1 {
                                maxleft = nums1[i-1]
                        } <span style="color: #989848;">else</span> {
                                <span style="color: #989848;">if</span> nums1[i-1] &gt; nums2[j-1] {
                                        maxleft = nums1[i-1]
                                } <span style="color: #989848;">else</span> {
                                        maxleft = nums2[j-1]
                                }
                        }

                        <span style="color: #989848;">return</span> <span style="color: #424242; font-weight: bold;">float64</span>(minright+maxleft) / 2.0
                }
        }

        <span style="color: #989848;">return</span> 0.0
}

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">main</span>() {
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, <span style="color: #424242; font-weight: bold;">findMedianSortedArrays</span>([]<span style="color: #0287c8; font-weight: bold;">int</span>{1, 2, 3, 5, 6, 7, 8}, []<span style="color: #0287c8; font-weight: bold;">int</span>{3, 4})) <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org45fee04" class="outline-3">
<h3 id="org45fee04"><span class="section-number-3">0.5</span> Longest Palindromic Substring</h3>
<div class="outline-text-3" id="text-0-5">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #989848;">package</span> main

<span style="color: #989848;">import</span> (
        <span style="color: #b85c57;">"fmt"</span>
)

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">longestPalindrome</span>(s <span style="color: #0287c8; font-weight: bold;">string</span>) <span style="color: #0287c8; font-weight: bold;">string</span> {
        <span style="color: #989848;">if</span> <span style="color: #424242; font-weight: bold;">len</span>(s) == 0 {
                <span style="color: #989848;">return</span> <span style="color: #b85c57;">""</span>
        }
        m := [1000][1000]<span style="color: #0287c8; font-weight: bold;">bool</span>{}
        <span style="color: #989848;">for</span> i := 0; i &lt; <span style="color: #424242; font-weight: bold;">len</span>(s); i++ {
                m[i][i] = <span style="color: #989848; font-weight: bold;">true</span>
        }
        <span style="color: #989848;">for</span> l := 1; l &lt; <span style="color: #424242; font-weight: bold;">len</span>(s); l++ {
                <span style="color: #989848;">for</span> i := 0; i+l &lt; <span style="color: #424242; font-weight: bold;">len</span>(s); i++ {

                        <span style="color: #989848;">if</span> i+1 &lt;= i+l-1 &amp;&amp; m[i+1][i+l-1] &amp;&amp; s[i] == s[i+l] {
                                m[i][i+l] = <span style="color: #989848; font-weight: bold;">true</span>
                        } <span style="color: #989848;">else</span> <span style="color: #989848;">if</span> l == 1 &amp;&amp; s[i] == s[i+l] {
                                m[i][i+l] = <span style="color: #989848; font-weight: bold;">true</span>
                        }
                }
        }

        max := 1
        maxs := <span style="color: #424242; font-weight: bold;">string</span>([]<span style="color: #424242; font-weight: bold;">byte</span>(s)[0:1])
        <span style="color: #989848;">for</span> i := 0; i &lt; <span style="color: #424242; font-weight: bold;">len</span>(s); i++ {
                <span style="color: #989848;">for</span> j := i; j &lt; <span style="color: #424242; font-weight: bold;">len</span>(s); j++ {
                        <span style="color: #989848;">if</span> m[i][j] &amp;&amp; j-i+1 &gt; max {
                                max = j - i + 1
                                maxs = <span style="color: #424242; font-weight: bold;">string</span>([]<span style="color: #424242; font-weight: bold;">byte</span>(s)[i : j+1])
                        }
                }
        }
        <span style="color: #989848;">return</span> maxs
}

<span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">main</span>() {
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, <span style="color: #424242; font-weight: bold;">longestPalindrome</span>(<span style="color: #b85c57;">"babad"</span>)) <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, <span style="color: #424242; font-weight: bold;">longestPalindrome</span>(<span style="color: #b85c57;">"cbbd"</span>))  <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>
        fmt.<span style="color: #424242; font-weight: bold;">Printf</span>(<span style="color: #b85c57;">"%+v\n"</span>, <span style="color: #424242; font-weight: bold;">longestPalindrome</span>(<span style="color: #b85c57;">""</span>))      <span style="color: #40883f;">// </span><span style="color: #40883f;">output for debug</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfeae17f" class="outline-3">
<h3 id="orgfeae17f"><span class="section-number-3">0.6</span> ZigZag Conversion</h3>
<div class="outline-text-3" id="text-0-6">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">convert</span>(s <span style="color: #0287c8; font-weight: bold;">string</span>, numRows <span style="color: #0287c8; font-weight: bold;">int</span>) <span style="color: #0287c8; font-weight: bold;">string</span> {
        <span style="color: #989848;">if</span> numRows == 1 {
                <span style="color: #989848;">return</span> s
        }
        lines := <span style="color: #424242; font-weight: bold;">make</span>([][]<span style="color: #0287c8; font-weight: bold;">byte</span>, numRows)
        i := 0
        add := <span style="color: #989848; font-weight: bold;">true</span>
        <span style="color: #989848;">for</span> _, c := <span style="color: #989848;">range</span> []<span style="color: #424242; font-weight: bold;">byte</span>(s) {
                lines[i] = <span style="color: #424242; font-weight: bold;">append</span>(lines[i], c)
                <span style="color: #989848;">if</span> add {
                        <span style="color: #989848;">if</span> i+1 &gt;= numRows {
                                i--
                                add = <span style="color: #989848; font-weight: bold;">false</span>
                        } <span style="color: #989848;">else</span> {
                                i++
                        }
                } <span style="color: #989848;">else</span> {
                        <span style="color: #989848;">if</span> i-1 &lt; 0 {
                                i++
                                add = <span style="color: #989848; font-weight: bold;">true</span>
                        } <span style="color: #989848;">else</span> {
                                i--
                        }
                }
        }

        <span style="color: #989848;">for</span> i := 1; i &lt; numRows; i++ {
                lines[0] = <span style="color: #424242; font-weight: bold;">append</span>(lines[0], lines[i]...)
        }
        <span style="color: #989848;">return</span> <span style="color: #424242; font-weight: bold;">string</span>(lines[0])
}
</pre>
</div>
</div>
</div>
