leetcode-notes.org.html
<div id="outline-container-org069f6ae" class="outline-3">
<h3 id="org069f6ae"><span class="section-number-3">0.7</span> Reverse Integer</h3>
<div class="outline-text-3" id="text-0-7">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">reverse</span>(x <span style="color: #0287c8; font-weight: bold;">int</span>) <span style="color: #0287c8; font-weight: bold;">int</span> {
        max := <span style="color: #424242; font-weight: bold;">int</span>(math.<span style="color: #424242; font-weight: bold;">Pow</span>(2.0, 31.0)) - 1
        min := <span style="color: #424242; font-weight: bold;">int</span>(math.<span style="color: #424242; font-weight: bold;">Pow</span>(-2.0, 31.0))
        r := 0
        <span style="color: #989848;">for</span> x != 0 {
                r = 10*r + (x % 10)
                <span style="color: #989848;">if</span> r &gt; max || r &lt; min {
                        <span style="color: #989848;">return</span> 0
                }
                x /= 10
        }
        <span style="color: #989848;">return</span> r
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org363f8f3" class="outline-3">
<h3 id="org363f8f3"><span class="section-number-3">0.8</span> String to Integer (atoi)</h3>
<div class="outline-text-3" id="text-0-8">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #989848;">func</span> <span style="color: #424242; font-weight: bold;">myAtoi</span>(str <span style="color: #0287c8; font-weight: bold;">string</span>) <span style="color: #0287c8; font-weight: bold;">int</span> {
        <span style="color: #989848;">if</span> str == <span style="color: #b85c57;">""</span> {
                <span style="color: #989848;">return</span> 0
        }
        max := <span style="color: #424242; font-weight: bold;">int</span>(math.<span style="color: #424242; font-weight: bold;">Pow</span>(2.0, 31)) - 1
        min := <span style="color: #424242; font-weight: bold;">int</span>(math.<span style="color: #424242; font-weight: bold;">Pow</span>(-2.0, 31))
        i := 0
        <span style="color: #989848;">for</span> ; i &lt; <span style="color: #424242; font-weight: bold;">len</span>(str); i++ {
                <span style="color: #989848;">if</span> str[i] != <span style="color: #b85c57;">' '</span> {
                        <span style="color: #989848;">break</span>
                }
        }
        <span style="color: #989848;">if</span> i == <span style="color: #424242; font-weight: bold;">len</span>(str) {
                <span style="color: #989848;">return</span> 0
        }
        negative := <span style="color: #989848; font-weight: bold;">false</span>
        <span style="color: #989848;">if</span> str[i] &gt;= <span style="color: #b85c57;">'0'</span> &amp;&amp; str[i] &lt;= <span style="color: #b85c57;">'9'</span> {
        } <span style="color: #989848;">else</span> <span style="color: #989848;">if</span> str[i] == <span style="color: #b85c57;">'+'</span> {
                i++
        } <span style="color: #989848;">else</span> <span style="color: #989848;">if</span> str[i] == <span style="color: #b85c57;">'-'</span> {
                negative = <span style="color: #989848; font-weight: bold;">true</span>
                i++
        } <span style="color: #989848;">else</span> {
                <span style="color: #989848;">return</span> 0
        }
        flag := <span style="color: #989848; font-weight: bold;">false</span>
        r := 0
        <span style="color: #989848;">for</span> ; i &lt; <span style="color: #424242; font-weight: bold;">len</span>(str); i++ {
                <span style="color: #989848;">if</span> str[i] &gt;= <span style="color: #b85c57;">'0'</span> &amp;&amp; str[i] &lt;= <span style="color: #b85c57;">'9'</span> {
                        flag = <span style="color: #989848; font-weight: bold;">true</span>
                        r = 10*r + (<span style="color: #424242; font-weight: bold;">int</span>(str[i]) - 48)
                        <span style="color: #989848;">if</span> r &gt; max &amp;&amp; !negative {
                                <span style="color: #989848;">return</span> max
                        } <span style="color: #989848;">else</span> <span style="color: #989848;">if</span> (-r) &lt; min &amp;&amp; negative {
                                <span style="color: #989848;">return</span> min
                        }
                } <span style="color: #989848;">else</span> <span style="color: #989848;">if</span> !flag {
                        <span style="color: #989848;">return</span> 0
                } <span style="color: #989848;">else</span> {
                        <span style="color: #989848;">break</span>
                }
        }
        <span style="color: #989848;">if</span> negative {
                <span style="color: #989848;">return</span> (-r)
        }
        <span style="color: #989848;">return</span> r
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1acfe1a" class="outline-2">
<h2 id="org1acfe1a"><span class="section-number-2">1</span> Bear in mind</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>检查类似 max, isXXX, flag 的变量是否更新</li>
<li>检查特殊输入,如空字符串</li>
</ul>
</div>
</div>
</div>
</body>
</html>
